#### Terraform Apply 🚀`success`
<details><summary>Show Apply</summary>

```

Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

The remote workspace is configured to work with configuration at
prod relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/learn-terraform-github-actions/learn-terraform-github-actions/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/learn-terraform-github-actions/learn-terraform-github-actions

To view this run in a browser, visit:
https://app.terraform.io/app/koichi-furukawa/learn-terraform-github-actions-prod/runs/run-iH7SPD75cqExbEnK

Waiting for the plan to start...

Terraform v1.6.4
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.example: Refreshing state... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/learn-terraform-github-actions-rg-prod]
azurerm_resource_group.example: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_resource_group.example will be destroyed
  # (because azurerm_resource_group.example is not in configuration)
  - resource "azurerm_resource_group" "example" {
      - id       = "/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/learn-terraform-github-actions-rg-prod" -> null
      - location = "japaneast" -> null
      - name     = "learn-terraform-github-actions-rg-prod" -> null
      - tags     = {} -> null
    }

  # module.azure_bot.azuread_application.application will be created
  + resource "azuread_application" "application" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "koichi-furukawa-example-prod"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)
    }

  # module.azure_bot.azurerm_bot_service_azure_bot.azure_bot will be created
  + resource "azurerm_bot_service_azure_bot" "azure_bot" {
      + display_name                 = (known after apply)
      + icon_url                     = "https://docs.botframework.com/static/devportal/client/images/bot-framework-default.png"
      + id                           = (known after apply)
      + local_authentication_enabled = true
      + location                     = "global"
      + microsoft_app_id             = (known after apply)
      + microsoft_app_type           = "MultiTenant"
      + name                         = "koichi-furukawa-example-bot-prod"
      + resource_group_name          = "koichi-furukawa-example-rg-prod"
      + sku                          = "F0"
      + streaming_endpoint_enabled   = false
    }

  # module.azure_bot.azurerm_resource_group.azure_bot_rg will be created
  + resource "azurerm_resource_group" "azure_bot_rg" {
      + id       = (known after apply)
      + location = "japaneast"
      + name     = "koichi-furukawa-example-rg-prod"
    }

Plan: 3 to add, 0 to change, 1 to destroy.

module.azure_bot.azuread_application.application: Creating...
azurerm_resource_group.example: Destroying... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/learn-terraform-github-actions-rg-prod]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Creating...
module.azure_bot.azuread_application.application: Creation complete after 4s [id=/applications/54590f24-4a67-4492-8021-23e2c51db364]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Creation complete after 4s [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-rg-prod]
module.azure_bot.azurerm_bot_service_azure_bot.azure_bot: Creating...
module.azure_bot.azurerm_bot_service_azure_bot.azure_bot: Creation complete after 2s [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-rg-prod/providers/Microsoft.BotService/botServices/koichi-furukawa-example-bot-prod]
azurerm_resource_group.example: Still destroying... [10s elapsed]
azurerm_resource_group.example: Destruction complete after 20s

Apply complete! Resources: 3 added, 0 changed, 1 destroyed.


```

</details>

*Pusher: @kooooichi24, Action: `push`, Working Directory: ``, Workflow: `Terraform Apply`*